Makro/Pruebas/Prueba 20.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|91|F|SETT|4001152|2022-03-25|19:05:00|COP|0|1|31|900059238|MAKRO SUPERMAYORISTA S.A.S|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|1|31|9010494382|CODESER SAS|CODESER SAS||||||MONTERIA|CR 13B 61 07|CO|49|1001820.00|1001820.00|1001820|0|0|0|1001820.00
ENEX|UBL 2.1|22|||||||2022-02-01||19:05:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|Cordoba|23|Cra.  14  No.  48 A 42 |CO|Colombia|2|31||2|23001|MONTERIA|Cordoba|23|CR 13B 61 07|CO|Colombia|2|31|-6.00|16FD|01552666|23|Colombia|23001|Cordoba|Colombia|23|111711|111711|
RS|2019-01-19|2030-01-19|SETT|1|50000000||18760000001
DE|1|116049|C62|20|2716.00|54320.00||0.00||false
DEDI|CILANTRO PQ 200g
DEDI|54320.00
DEDIEX||999|1|||
DEIM|0.00|54320.00|0.00|0.00|01|IVA||C62|0
DE|2|116199|KGM|60|7841.00|470460.00||0.00||false
DEDI|PIMENTON ROJO kg
DEDI|470460.00
DEDIEX||999|1|||
DEIM|0.00|470460.00|0.00|0.00|01|IVA||KGM|0
DE|3|116091|C62|4|5585.00|22340.00||0.00||false
DEDI|FRESA TERCERA BJ 500g
DEDI|22340.00
DEDIEX||999|1|||
DEIM|0.00|22340.00|0.00|0.00|01|IVA||C62|0
DE|4|31392|CH|40|3060.00|122400.00||0.00||false
DEDI|APIO EMPAQUE UNIDAD
DEDI|122400.00
DEDIEX||999|1|||
DEIM|0.00|122400.00|0.00|0.00|01|IVA||CH|0
DE|5|116138|C62|4|2180.00|8720.00||0.00||false
DEDI|LECHUGA VERDE CRESPA HID 180g
DEDI|8720.00
DEDIEX||999|1|||
DEIM|0.00|8720.00|0.00|0.00|01|IVA||C62|0
DE|6|116200|KGM|60|5393.00|323580.00||0.00||false
DEDI|TOMATE CHONTO kg
DEDI|323580.00
DEDIEX||999|1|||
DEIM|0.00|323580.00|0.00|0.00|01|IVA||KGM|0
RE|01|16FD-25756059|01|Devolucion de parte de los bienes|2022-02-01||
DIT|0.00
DI||1001820.00|0.00|0|01|0.00|IVA||
PE|prom|0
PE|zona|16012525
PE|idInterno|1681 202232171
PE|Caja|81 440
PE|CentroDistribucion|MAKRO MONTERIA
PE|TelCentroDistribucion|7849899
PE|PasaporteCliente|16 21730960
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|BarrioCliente|N/A
PE|TelefonoCliente|3214249810
PE|CorreoDist|gisellaherazog@gmail.com
PE|CodigoBarras|220321711905814400260
PE|vrNotaCredito|1.001.820,00
FP|1|72|2022-02-01|-11
PE|Plantilla|T07_MBS.jasper
PE|PPLTienda|ST16
PE|PPLCaja|99
PE|MontoenLetras|Un Millon Un Mil Ochocientos Veinte pesos M/CTE.
PES|ResolucionesNotaCredito
PESD|1| ESTA NOTA CREDITO SERA VALIDA POR SESENTA (60) DIAS A PARTIR DE LA FECHA DE SU EXPEDICION 
PESD|2| Y SE HARA EFECTIVA UNICAMENTE PARA LA ADQUISICION DE MERCANCIA EN LA TIENDA QUE LA EMITE.
PESD|3| MAKRO SUPERMAYORISTA S.A.S., NO SE HARA RESPONSABLE POR LA PERDIDA DE ESTE DOCUMENTO. 
PESD|4| ESTE DOCUMENTO NO CONSTITUYE TITULO VALOR, POR LO TANTO NO ES NEGOCIABLE NI REDIMIBLE EN DINERO.
PES|TextoInformativoFactura
PESD|1|ACEPTO QUE HE RECIBIDO, LOS BIENES DESCRITOS Y LA PRESENTE FACTURA, EN LA FECHA DE EXPEDICION DE LA MISMA Y ACEPTO LA PRESENTE FACTURA Y LAS OBLIGACIONES CONTENIDAS EN ELLA
PESD|2|LA PRESENTE FACTURA VENCE A LOS TREINTA  (30) DIAS CORRIENTES CONTADOS A PARTIR DE LA EXPEDICION DE LA MISMA
PESD|3|LA PRESENTE FACTURA CAMBIARIA DE COMPRAVENTA SE ASIMILA A LETRA DE CAMBIO (ART. 774 DEL CODIGO DE COMERCIO)
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020 CAMBIOS DENTRO DE LOS 7 DIAS HABILES A PARTIR DE LA COMPRA,PRESENTA LA FACTURA
PESD|2|Observaciones: 
CTE||||dte_9000592385@dte.paperless.com.co|
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope>